# Analyzing American Baby Name Trends

In the Analyzing American Baby Name Trends project, you'll study data provided by the U.S. Social Security Administration 
containing first names, which were given to over 5,000 American babies each year for the period of 101 years. The main goal 
is to understand how American baby name tastes changed by investigating trends of popularity. In particular, you're going to 
discover:

* Classic American names for over 100 years
* The type of popularity for each name: timeless vs. trendy
* The top 10 female names
* The most popular female name ending in "a" since 2015
* The most popular male names by year
* The most popular male name for the largest number of years

Skills used:
* CASE WHEN statements
* Pattern matching using the LIKE operator
* Subqueries
* Common table expressions (CTEs)
* Window functions
* Joining data
* Aggregate functions
* Filtering grouped data
* Sorting, filtering, and grouping

In [2]:
%load_ext sql

In [3]:

host = "localhost"
user = "root"
password = ""
database = "babyNames"

# Create a connection string
connection_string = f"mysql+mysqlconnector://{user}:{password}@{host}/{database}"

# Connect to the database
%sql $connection_string

In [3]:
%%sql

-- Create a table
CREATE TABLE IF NOT EXISTS baby_names (
    year INT,
    first_names VARCHAR(255),
    sex varchar(2),
    num INT
);

-- Load data from CSV into the table
LOAD DATA INFILE 'C:/usa_baby_names.csv'
INTO TABLE baby_names
FIELDS TERMINATED BY ','
ENCLOSED BY '"'
LINES TERMINATED BY '\n'
IGNORE 1 ROWS;

In [4]:
%%sql

SELECT * FROM baby_names LIMIT 5;

 * mysql+mysqlconnector://root:***@localhost/babyNames
5 rows affected.

[(1920, 'Mary', 'F', 70982),
 (1920, 'Dorothy', 'F', 36643),
 (1920, 'Helen', 'F', 35097),
 (1920, 'Margaret', 'F', 27994),
 (1920, 'Ruth', 'F', 26101)]

#### 1. Classic American names for over 100 years

The tables below provides the names that have been given to babies of either sex every year (from 1920 to 2020). There are a lot male names with Elizabeth being the only female name in the top 8.

In [5]:
%%sql
SELECT first_names, SUM(num) AS total FROM baby_names 
GROUP BY first_names 
HAVING COUNT(first_names) = 101 
ORDER BY total DESC;

 * mysql+mysqlconnector://root:***@localhost/babyNames
8 rows affected.

[('James', Decimal('4748138')),
 ('John', Decimal('4510721')),
 ('William', Decimal('3614424')),
 ('David', Decimal('3571498')),
 ('Joseph', Decimal('2361382')),
 ('Thomas', Decimal('2166802')),
 ('Charles', Decimal('2112352')),
 ('Elizabeth', Decimal('1436286'))]

#### 2. The type of popularity for each name: timeless vs. trendy

We'll attempt to capture the type of popularity that each name in the dataset enjoyed. Was the name classic and popular across many years or trendy, only popular for a few years? Let's find out.

In [6]:
%%sql
SELECT first_names, SUM(num) AS total, COUNT(*) as count_yrs,
CASE
    WHEN COUNT(first_names) > 20 THEN 'Semi-Trendy'
    WHEN COUNT(first_names) > 50 THEN 'Semi-Classic'
    WHEN COUNT(first_names) > 80 THen 'Classic'
    ELSE 'Trendy'
END AS popularity_type
FROM baby_names 
GROUP BY first_names 
ORDER BY total DESC
LIMIT 10;

 * mysql+mysqlconnector://root:***@localhost/babyNames
10 rows affected.

[('James', Decimal('4748138'), 101, 'Semi-Trendy'),
 ('John', Decimal('4510721'), 101, 'Semi-Trendy'),
 ('Robert', Decimal('4495199'), 99, 'Semi-Trendy'),
 ('Michael', Decimal('4278824'), 85, 'Semi-Trendy'),
 ('William', Decimal('3614424'), 101, 'Semi-Trendy'),
 ('David', Decimal('3571498'), 101, 'Semi-Trendy'),
 ('Mary', Decimal('3215850'), 84, 'Semi-Trendy'),
 ('Richard', Decimal('2414838'), 84, 'Semi-Trendy'),
 ('Joseph', Decimal('2361382'), 101, 'Semi-Trendy'),
 ('Thomas', Decimal('2166802'), 101, 'Semi-Trendy')]

#### 3. The top 10 female names

Since we didn't get many traditionally female names in our classic American names search in the first task, let's limit our search to names which were given to female babies.

In [7]:
%%sql

SELECT first_names, SUM(num) AS total
FROM baby_names 
WHERE sex = 'F'
GROUP BY first_names 
ORDER BY total DESC
LIMIT 10;

 * mysql+mysqlconnector://root:***@localhost/babyNames
10 rows affected.

[('Mary', Decimal('3215850')),
 ('Patricia', Decimal('1479802')),
 ('Elizabeth', Decimal('1436286')),
 ('Jennifer', Decimal('1404743')),
 ('Linda', Decimal('1361021')),
 ('Barbara', Decimal('1343901')),
 ('Susan', Decimal('1025728')),
 ('Jessica', Decimal('994210')),
 ('Lisa', Decimal('920119')),
 ('Betty', Decimal('893396'))]

#### Added rank for furthur identify top female names

In [7]:
%%sql
SELECT first_names, SUM(num),
       RANK() OVER (ORDER BY SUM(num) DESC) AS name_rank
FROM baby_names 
WHERE sex = 'F'
GROUP BY first_names 
ORDER BY name_rank
LIMIT 10;

 * mysql+mysqlconnector://root:***@localhost/babyNames
10 rows affected.

[('Mary', Decimal('3215850'), 1),
 ('Patricia', Decimal('1479802'), 2),
 ('Elizabeth', Decimal('1436286'), 3),
 ('Jennifer', Decimal('1404743'), 4),
 ('Linda', Decimal('1361021'), 5),
 ('Barbara', Decimal('1343901'), 6),
 ('Susan', Decimal('1025728'), 7),
 ('Jessica', Decimal('994210'), 8),
 ('Lisa', Decimal('920119'), 9),
 ('Betty', Decimal('893396'), 10)]

#### 4. The most popular female name ending in "a" since 2015

For more recent popular female baby names that end with "a", look below.

In [8]:
%%sql

SELECT first_names, SUM(num) AS total
FROM baby_names 
WHERE year > 2015 AND sex = 'F' AND first_names LIKE '%a'
GROUP BY first_names 
ORDER BY total DESC
LIMIT 10;

 * mysql+mysqlconnector://root:***@localhost/babyNames
10 rows affected.

[('Olivia', Decimal('92178')),
 ('Emma', Decimal('90865')),
 ('Ava', Decimal('74856')),
 ('Sophia', Decimal('71760')),
 ('Isabella', Decimal('69977')),
 ('Mia', Decimal('64248')),
 ('Amelia', Decimal('60602')),
 ('Ella', Decimal('39498')),
 ('Sofia', Decimal('39295')),
 ('Camila', Decimal('36245'))]

#### 5. How did Olivia become popular over the years?

Olivia has had a meteoric rise!

In [9]:
%%sql

SELECT year, first_names, num,
       SUM(num) OVER (ORDER BY year) AS cumsum
FROM baby_names 
WHERE first_names = 'Olivia'
ORDER BY year
LIMIT 10;

 * mysql+mysqlconnector://root:***@localhost/babyNames
10 rows affected.

[(1991, 'Olivia', 5601, Decimal('5601')),
 (1992, 'Olivia', 5809, Decimal('11410')),
 (1993, 'Olivia', 6340, Decimal('17750')),
 (1994, 'Olivia', 6434, Decimal('24184')),
 (1995, 'Olivia', 7624, Decimal('31808')),
 (1996, 'Olivia', 8124, Decimal('39932')),
 (1997, 'Olivia', 9477, Decimal('49409')),
 (1998, 'Olivia', 10610, Decimal('60019')),
 (1999, 'Olivia', 11255, Decimal('71274')),
 (2000, 'Olivia', 12852, Decimal('84126'))]

#### 6. The most popular male names by year

Recently, it looks like Liam, Noah and Jacob are popular

In [10]:
# %%sql
# Subquery below
# SELECT year, MAX(num)
# FROM baby_names 
# WHERE sex = 'M'
# GROUP BY year
# LIMIT 10;

In [11]:
%%sql

SELECT bn.year, bn.first_names, bn.num
FROM baby_names bn
JOIN (SELECT year, MAX(num) as c FROM baby_names WHERE sex = 'M'GROUP BY year) AS subTable
ON bn.year = subTable.year AND bn.num = subTable.c
ORDER BY bn.year DESC
LIMIT 10;

 * mysql+mysqlconnector://root:***@localhost/babyNames
10 rows affected.

[(2020, 'Liam', 19659),
 (2019, 'Liam', 20555),
 (2018, 'Liam', 19924),
 (2017, 'Liam', 18824),
 (2016, 'Noah', 19154),
 (2015, 'Noah', 19650),
 (2014, 'Noah', 19319),
 (2013, 'Noah', 18266),
 (2012, 'Jacob', 19088),
 (2011, 'Jacob', 20378)]

#### 7. The most popular male name for the largest number of years

While Jacob and Noah were popular for a long time, let's look at names that were popular for largest number of years.

In [24]:
%%sql

WITH subQuery AS(
    SELECT bn.year, bn.first_names, bn.num
    FROM baby_names bn
    JOIN (SELECT year, MAX(num) as c FROM baby_names WHERE sex = 'M'GROUP BY year) AS subTable
    ON bn.year = subTable.year AND bn.num = subTable.c
    ORDER BY bn.year DESC
)
SELECT first_names, count(*) as num
FROM subQuery
GROUP BY first_names
ORDER BY num DESC;

 * mysql+mysqlconnector://root:***@localhost/babyNames
8 rows affected.

[('Michael', 44),
 ('Robert', 17),
 ('Jacob', 14),
 ('James', 13),
 ('John', 4),
 ('Noah', 4),
 ('Liam', 4),
 ('David', 1)]

In [16]:
%sql --close $connection_string